interface Question {
  question: string;
  options: string[];
}

const loveConcept: Question[] = [
  {
    question: '你想象中的爱情是',
    options: ['具有令人神往的浪漫色彩','能满足自己的情欲','使人振奋向上','没想过']
  },
  {
    question: '你希望与恋人是这样结识的',
    options: ['在工作和学习中逐渐产生感情','从小青梅竹马','一见钟情','随便']
  },
  {
    question: '你认为完美的婚姻应该是',
    options: ['门当户对','郎才女貌','心心相印','情趣相投']
  },
  {
    question: '你认为巩固爱情的最好途径是',
    options: ['满足对方的物质要求','用甜言蜜语取悦对方','对爱人言听计从','努力使自己变得完美']
  },
  {
    question: '下列爱情格言中你最喜欢',
    options: ['生命诚可贵，爱情价更高','爱情的意义在于帮助对方提高，同时自也提高','有福同享，有难同当','为了爱，我什么都愿意做']
  },
  {
    question: '你希望恋人同你在兴趣爱好上',
    options: ['完全一致','虽不一致但能相互照应','服从自己的兴趣','互不干涉']
  },
  {
    question: '你对恋爱中的意外曲折是这样看的',
    options: ['最好不要出现','自认倒霉','想办法分手','把它当作对爱情的考验']
  },
  {
    question: '当你发现恋人的意外缺点时，你的态度是',
    options: ['无所谓','嫌弃对方','内心十分痛苦','帮助对方改进']
  },
  {
    question: '你对家庭的向往是',
    options: ['能同爱人天天在一起','人生有了归宿','能享受天伦之乐','激励对生活的追求']
  },
  {
    question: '自己有一位异性朋友时',
    options: ['告诉恋人，并在对方同意下继续同异性朋友交往','让对方知道，但不允许对方干涉','不告诉对方，因为这是自己的权利','可以告诉也可以不告诉，要看恋人的气量和态度']
  },
  {
    question: '一位比恋人条件更好的异性对自己有好感，你是',
    options: ['讨好对方','保持友谊，在必要时向对方说明真实情况','十分冷淡','听之任之']
  },
  {
    question: '当你迟迟找不到理想的恋人时，你会',
    options: ['反省自己的择偶标准是否切合实际','一如既往','心灰意懒','随便找一个算了']
  },
  {
    question: '当你所爱的人不爱你时，你会',
    options: ['愉快地同对方分手','毁坏对方的名誉','千方百计缠住对方','不知所措']
  },
  {
    question: '你的恋人对你变心时',
    options: ['采取“你不仁我不义”的报复手段','到处诉说对方的不是','只当自己瞎了眼','从中吸取择偶交友的教训']
  },
  {
    question: '当你发现你所爱的人已有恋人时，你会',
    options: ['更加热烈的追求','用一切手段拆散他们','若对方尚未确定关系，就进行合理的竞争','不管对方是否确定关系，自己都主动退出']
  },
  {
    question: '你认为理想的婚礼应该是',
    options: ['能留下美好而有意义的回忆的','有排场、为人所羡慕的','亲朋满座，热闹非凡的','双方父母满意的']
  },
]

export default loveConcept;